Revit 2027 API
ColorFillSchemeEntry.SetIntegerValue Method
 Sets new Integer value of entry.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetIntegerValue(
	int value
)
Public Sub SetIntegerValue (
	value As Integer
)
public:
void SetIntegerValue(
	int value
)
member SetIntegerValue :
        value : int -> unit
Parameters
value Int32
Exceptions
Exception | Condition
InvalidOperationException |  The entry has different storage type with Integer.
Remarks
 You should only use this method if the StorageType property reports the type of the entry as a Integer.
See Also
Reference
ColorFillSchemeEntry Class
Autodesk.Revit.DB Namespace